<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class MathSecThirdSeeder extends Seeder
{
    public function run()
    {
        DB::table('math_second_third')->insert([
            [
                'question' => 'اختر العدد (خمسة)',
                'correct_answer' => '5'
            ],
            [
                'question' => 'اختر العدد (مئة وخمسة وستون)',
                'correct_answer' => '165'
            ],
            [
                'question' => 'اكتب العدد المناسب في المربع: 18 + ؟ = 21',
                'correct_answer' => '3'
            ],
            [
                'question' => 'اكتب العدد الذي إذا أضفناه إلى 17 يصبح الناتج 60.',
                'correct_answer' => '43'
            ],
            [
                'question' => 'اكتب العدد المناسب في المربع: 15, ؟, 25, 30',
                'correct_answer' => '20'
            ],
            [
                'question' => 'اكتب العدد المناسب في المربع: 120, 130, ؟, 150',
                'correct_answer' => '140'
            ],
            [
                'question' => 'اكتب العدد المناسب في المربع: 3050, 3150, 3250, ؟',
                'correct_answer' => '3350'
            ],
            [
                'question' => 'اكتب العدد المناسب في المربع: 112, 114, ؟, 118',
                'correct_answer' => '116'
            ],
            [
                'question' => 'اكتب العدد الذي إذا طرحناه من 30 يصبح الناتج 270.',
                'correct_answer' => '300'
            ],
            [
                'question' => 'مع حمزة 57 دينارًا اشترى ملابس بـ 25 دينارًا، كم دينارًا بقي معه؟',
                'correct_answer' => '32'
            ],
            [
                'question' => 'أراد يزن زراعة 40 شجرة زيتون في 5 صفوف، فكم شجرة زيتون يحتاج في الصف الواحد؟',
                'correct_answer' => '8'
            ],
            [
                'question' => 'جمعت عائشة 65 طابعًا بريديًا وجمع أخوها محمد 35 طابعًا بريديًا، كم يزيد عدد الطوابع التي جمعتها عائشة عن التي جمعها محمد؟',
                'correct_answer' => '30'
            ],
            [
                'question' => 'إذا كان لديك 4 مزهريات، وفي كل مزهرية 3 أزهار، ما عدد الأزهار الكلي؟',
                'correct_answer' => '12'
            ],
            [
                'question' => 'لدى علي سلة من التفاح فيها 62 حبة 🍎، تقاسمها بالتساوي مع أخته ليلى، فكم حبة تفاح 🍎 نصيب كل منهما؟',
                'correct_answer' => '31'
            ],
            [
                'question' => 'اكتب العدد الذي إذا طرحناه من 670 يصبح الناتج 170.',
                'correct_answer' => '500'
            ],
            [
                'question' => 'اكتب العدد الذي إذا أضفناه إلى 7 يصبح الناتج 18.',
                'correct_answer' => '11'
            ],
            [
                'question' => 'اكتب العدد الذي إذا أضفناه إلى 66 يصبح الناتج 70.',
                'correct_answer' => '4'
            ],
            [
                'question' => 'اكتب العدد الذي إذا طرح من 85 يصبح الناتج 80.',
                'correct_answer' => '5'
            ],
            [
                'question' => 'لدينا 10 أطفال في الصف، إذا كان 6 منهم بنين والباقي بنات، فكم عدد البنات في الصف؟',
                'correct_answer' => '4'
            ],
            [
                'question' => 'اكتب العدد الذي يمثل مجموع 207 و 83.',
                'correct_answer' => '290'
            ],
            [
                'question' => 'ضع في المربع الناتج الذي يمثل ضعف العدد 42.',
                'correct_answer' => '84'
            ],
            [
                'question' => 'ضع في المربع الناتج الذي يمثل نصف العدد 54.',
                'correct_answer' => '27'
            ],
            [
                'question' => 'لدى سارة مجموعة من الطوابع البريدية، وزعت 20 طابعًا وتبقى معها 45 طابعًا، فكم طابعًا كان معها؟',
                'correct_answer' => '65'
            ],
            [
                'question' => 'اكتب العدد المناسب في المربع: 356 - 38 = ؟',
                'correct_answer' => '318'
            ],
            [
                'question' => 'اكتب العدد المناسب في المربع: 16 × 10 = ؟',
                'correct_answer' => '160'
            ]
        ]);
    }
}
